spec/cassettes/GoPay_Payment/create/returns_existing_payment_for_standard_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://client_id_filtered:client_secret_filtered@testgw.gopay.cz/api/oauth2/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials&scope=payment-create
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - unirest-ruby/1.1
      Content-Length:
      - '50'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 03 Mar 2016 16:17:02 GMT
      Server:
      - GOPAY
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains; preload
      X-Powered-By:
      - GOPAY
      X-Xss-Protection:
      - 1; mode=block
      X-Frame-Options:
      - SAMEORIGIN
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/json
      Set-Cookie:
      - "<SET COOKIE FILTERED OUT>"
      Vary:
      - Accept-Encoding
      Content-Encoding:
      - gzip
      Cache-Control:
      - max-age=600
      Expires:
      - Thu, 03 Mar 2016 16:27:02 GMT
      Content-Length:
      - '271'
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAAAz2OwW6CMABA/6VXTKC4KCzxgHNrVQQRujkvpsMK1QmlFCqY
        /fvIDru+d3jvAVR5ZcVRdYKBZ/DFqGQSjABNU1bXxz858G0Mlbe8re7oHeps
        LHvuJEGkgzuNIHSf9nxR7DAUF7NE+6pv1oQUn4UMohLGpspwm/i2R0LBmfWa
        CbM6aa5XRoI3ltjpfaWqpr2EHzrsJ4TMhjq7Cy5ZfeRDGzqWNQKSnQeQ/w9p
        dy43Z8+oDc/BL87UmOhxL6yOmBoaSditES0aCrdpYpzcKJvfdm2+qnEz8XNG
        kR8XOcJ8vKjlPIyVT6eHDi4tGr3JK0ZXhcWN2J5G9qH5Tmfg5xcifkKuJgEA
        AA==
    http_version: 
  recorded_at: Thu, 03 Mar 2016 16:17:00 GMT
- request:
    method: post
    uri: https://testgw.gopay.cz/api/payments/payment
    body:
      encoding: UTF-8
      string: '{"payer":{"allowed_payment_instruments":["BANK_ACCOUNT"],"contact":{"first_name":"John","last_name":"Doe","email":"john@example.com"}},"amount":10000,"currency":"CZK","order_number":"order-1","order_description":"foo","lang":"CS","callback":{"return_url":"http://localhost","notification_url":"http://localhost/2"},"target":{"type":"ACCOUNT","goid":"8431713532"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip
      Content-Type:
      - application/json
      Authorization:
      - "<AUTHORIZATION FILTERED OUT>"
      User-Agent:
      - unirest-ruby/1.1
      Content-Length:
      - '363'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 03 Mar 2016 16:17:02 GMT
      Server:
      - GOPAY
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains; preload
      X-Powered-By:
      - GOPAY
      X-Xss-Protection:
      - 1; mode=block
      X-Frame-Options:
      - SAMEORIGIN
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/json
      Set-Cookie:
      - "<SET COOKIE FILTERED OUT>"
      Vary:
      - Accept-Encoding
      Content-Encoding:
      - gzip
      Cache-Control:
      - max-age=600
      Expires:
      - Thu, 03 Mar 2016 16:27:02 GMT
      Content-Length:
      - '430'
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAAA61STW/bMAz9Lzx7SfxRZ8lpWdrLCnTA0F02FAIt0Y43WTJk
        aalX5L9PimM76Iqd5pP4TD4+PvIFagHbdJWs8yy7ifMIWjSkLAuwclJGoI0g
        w5RrCjKwHcJ3MUTQWbTkkf2Xu93j3W1AXMEu6FDbYt+c2VRnjQvP8Q822oUo
        XvkvAu6Mb8v7QPftHs6Vod3Lvyik1EcS7O+MDrbf4ePu4Z7t9vvPXx8e4WlO
        7451GTIGEkElOmnfIHmdca4bwUrPBlGDtZwmPmhFk1sDVqD6yZDzYeIB80Gr
        1WufOBoxZyiL3AYPytp0lilsgt2f9EF5gyTO0K0mmHTAD5/wgZ6xaSUtuG7g
        bVW8tv349jMTTdpa7ZcoGdeCruQqa/or7HSKwKKp6KzQ9m0QMto9GvQ+S+N1
        nN6kyX+xaTyaIRq6Xzbp1Ri6XNF8fobQ2YM29W+09RWPEHWI/ZD+3LGZrkGi
        qvwYvAsTHJkzwc+DtW23XS6r46JDJQr9vKi031jw1oPLX+kyx1zkK87XeZol
        nGdlUsa0SZNNnKebFRZw+gO9/0sBaQMAAA==
    http_version: 
  recorded_at: Thu, 03 Mar 2016 16:17:01 GMT
recorded_with: VCR 3.0.1
