spec/cassettes/GoPay_Gateway/retrieve/returns_existing_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://testgw.gopay.cz/api/oauth2/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials&scope=payment-all
    headers:
      Accept:
      - application/json
      User-Agent:
      - rest-client/2.1.0 (darwin17.7.0 x86_64) ruby/2.5.3p105
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - "<AUTHORIZATION FILTERED OUT>"
      Content-Length:
      - '47'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - testgw.gopay.cz
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 19 Oct 2019 13:12:33 GMT
      Server:
      - Apache
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains; preload
      Cache-Control:
      - no-cache, no-store, must-revalidate, max-age=600
      X-Xss-Protection:
      - 1; mode=block
      X-Frame-Options:
      - SAMEORIGIN
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/json
      Set-Cookie:
      - "<SET COOKIE FILTERED OUT>"
      Vary:
      - Accept-Encoding
      Expires:
      - Sat, 19 Oct 2019 13:22:33 GMT
      Content-Length:
      - '272'
    body:
      encoding: ASCII-8BIT
      string: '{"token_type":"bearer","access_token":"TXrkmyOJvZ8CQeoru8eIbuvwmrJ4TYGVNVq5JcLYCa47HhODPqk6tPkggCXIbqqkn8RrNz5lkRNZhDaZYfPKbuRXmAZBlgRlx4xvUaw/q68=","expires_in":1800,"refresh_token":"Fv9uD0bAyNjMEhI1gZer0SYwO3+dkURtInF4D07pyNljBmr0VwCtU0uDD5+3+Is/IuF9zOe0r59CWSmUzoAIi8BRAxyC7FTOC7YePiYgULc="}'
    http_version: 
  recorded_at: Sat, 19 Oct 2019 13:12:33 GMT
- request:
    method: get
    uri: https://testgw.gopay.cz/api/payments/payment/3090060402
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      User-Agent:
      - rest-client/2.1.0 (darwin17.7.0 x86_64) ruby/2.5.3p105
      Content-Type:
      - application/x-www-form-urlencoded
      Authorization:
      - "<AUTHORIZATION FILTERED OUT>"
      Content-Length:
      - '0'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Host:
      - testgw.gopay.cz
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 19 Oct 2019 13:12:33 GMT
      Server:
      - Apache
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains; preload
      Cache-Control:
      - no-cache, no-store, must-revalidate, max-age=600
      X-Xss-Protection:
      - 1; mode=block
      X-Frame-Options:
      - SAMEORIGIN
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/json
      Set-Cookie:
      - "<SET COOKIE FILTERED OUT>"
      Vary:
      - Accept-Encoding
      Expires:
      - Sat, 19 Oct 2019 13:22:33 GMT
      Content-Length:
      - '402'
    body:
      encoding: ASCII-8BIT
      string: '{"id":3090060402,"order_number":"order-1","state":"REFUNDED","payment_instrument":"PAYMENT_CARD","amount":10000,"currency":"CZK","payer":{"allowed_payment_instruments":["PAYMENT_CARD"],"payment_card":{"card_number":"418803******0003","card_expiration":"2112","card_brand":"VISA
        Electron","card_issuer_country":"CZE","card_issuer_bank":"KOMERCNI BANKA,
        A.S."},"contact":{"first_name":"John","last_name":"Doe","email":"john@example.com","country_code":"CZE"}},"target":{"type":"ACCOUNT","goid":1111111111},"lang":"cs","gw_url":"https://gw.sandbox.gopay.com/gw/v3/95c24246256a19e1f4903d18a5cb9c31"}'
    http_version: 
  recorded_at: Sat, 19 Oct 2019 13:12:33 GMT
recorded_with: VCR 5.0.0
